init.org
#+TITLE: Emacs config (single source of truth)
#+PROPERTY: header-args:emacs-lisp :lexical t
#+OPTIONS: toc:nil

* early-init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  ;;; early-init.el --- generated from init.org  -*- lexical-binding: t; -*-

  ;; ========== 1) GC 临时加速：启动期最大化，启动后恢复 ==========
  (defvar my/startup-gc-cons-threshold gc-cons-threshold
    "GC threshold before startup optimization.")

  (defvar my/startup-gc-cons-percentage gc-cons-percentage
    "GC percentage before startup optimization.")

  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)

  ;; 启动完成后恢复一个“偏大但不夸张”的阈值，避免运行期卡顿/内存膨胀
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold (max my/startup-gc-cons-threshold (* 64 1024 1024))
                    gc-cons-percentage my/startup-gc-cons-percentage)))

  ;; ========== 2) file-name-handler-alist 临时加速（对启动很关键） ==========
  (defvar my/startup-file-name-handler-alist file-name-handler-alist
    "Saved `file-name-handler-alist' during startup.")

  (setq file-name-handler-alist nil)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist my/startup-file-name-handler-alist)))

  ;; ========== 3) Native compilation / load 策略 ==========
  (setq load-prefer-newer t)

  ;; Emacs 28+ 默认就是 jit 异步 native comp；保留没问题
  (setq native-comp-jit-compilation t)

  ;; 一般建议关掉 native comp 的警告刷屏（不是性能项，但减少启动噪音）
  (setq native-comp-async-report-warnings-errors nil)

  ;; ========== 4) 编码（早期设置 OK） ==========
  (prefer-coding-system 'utf-8)
  (setq-default buffer-file-coding-system 'utf-8)

  ;; ========== 5) Frame/UI：放 early-init 合理（避免 first frame 闪烁） ==========
  (setq frame-inhibit-implied-resize t)

  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
  (setq load-suffixes '(".elc" ".el"))
  (setq load-file-rep-suffixes '(""))

  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle init.el
:END:
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  ;;; init.el --- generated from init.org  -*- lexical-binding: t; -*-
  ;; ========== 包管理 / use-package ==========
  (require 'package)
  (setq package-archives '(("gnu"    . "https://mirrors.ustc.edu.cn/elpa/gnu/")
                           ("melpa"  . "https://mirrors.ustc.edu.cn/elpa/melpa/")
                           ("nongnu" . "https://mirrors.ustc.edu.cn/elpa/nongnu/")))
  ;; 避免重复初始化带来开销（同时也避免某些配置误触 refresh）
  (setq package-enable-at-startup nil)
  (package-initialize)
  ;; Bootstrap use-package（仅当缺失时执行一次 refresh）
  (unless (package-installed-p 'use-package)
   (when (null package-archive-contents)
      (package-refresh-contents))
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile (require 'use-package))
  (setq use-package-always-ensure nil)
  (setq use-package-expand-minimally t)
#+END_SRC
** 基础配置
*** 核心设置
#+begin_src emacs-lisp
  ;; 命令行选项
  (setq command-line-x-option-alist nil)

  ;; 进程 IO 优化
  (setq read-process-output-max #x10000)  ; 64kb

  ;; 禁用 ffap 域名检测
  (setq ffap-machine-p-known 'reject)

  ;; 个人信息
  (setq user-full-name "Wei"
        user-mail-address "Jiawei0655@gmail.com")

  ;; UTF-8 编码
  (when (fboundp 'set-charset-priority)
    (set-charset-priority 'unicode))
  (prefer-coding-system 'utf-8)
  (setq locale-coding-system 'utf-8)
  (setq system-time-locale "C")

  ;; GC 管理
  (use-package gcmh
    :ensure t
    :diminish
    :hook (emacs-startup . gcmh-mode)
    :custom
    (gcmh-idle-delay 'auto)
    (gcmh-auto-idle-delay-factor 10)
    (gcmh-high-cons-threshold #x12800000))

  ;; Server 模式
 
(use-package server
  :ensure nil
  :hook (after-init . server-mode))

  ;; 保存位置
  (use-package saveplace
    :defer t
     :hook (after-init . save-place-mode)
    :config (setq save-place-file (locate-user-emacs-file "etc/places")))

  ;; 最近文件
  (use-package recentf
    :defer 1
    :bind (("C-x C-r" . recentf-open-files))
     :hook (after-init . recentf-mode)
    :custom
    (recentf-max-saved-items 300)
    (recentf-auto-cleanup 'never)
    (recentf-exclude
     '("^/private/tmp/"
       "^/var/folders/"
       "^/tmp/"
       "/ssh\\(x\\)?:"
       "/su\\(do\\)?:"
       "^/usr/include/"
       "/TAGS\\'"
       "COMMIT_EDITMSG\\'"))
    :config (setq recentf-save-file (locate-user-emacs-file "etc/recentf")))

  ;; 历史记录
  (use-package savehist
    :hook (after-init . savehist-mode)
    :init (setq enable-recursive-minibuffers t
                history-length 1000
                savehist-file (locate-user-emacs-file "etc/history")
                savehist-additional-variables '(mark-ring
                                                global-mark-ring
                                                search-ring
                                                regexp-search-ring
                                                extended-command-history)
                savehist-autosave-interval 300))
#+end_src

*** Simple 模式增强

#+begin_src emacs-lisp
  (use-package simple
    :ensure nil
    :hook ((after-init . size-indication-mode)
           (text-mode . visual-line-mode)
           ((prog-mode markdown-mode conf-mode) . enable-trailing-whitespace))
    :init
    (setq column-number-mode t
          line-number-mode t
          line-move-visual nil
          track-eol t
          set-mark-command-repeat-pop t)

    (setq-default show-trailing-whitespace nil)
    (defun enable-trailing-whitespace ()
      "Show trailing spaces and delete on saving."
      (setq show-trailing-whitespace t)
      (add-hook 'before-save-hook #'delete-trailing-whitespace nil t))

    ;; 美化进程列表
    (with-no-warnings
      (defun my/list-processes--prettify ()
        "Prettify process list."
        (when-let* ((entries tabulated-list-entries))
          (setq tabulated-list-entries nil)
          (dolist (p (process-list))
            (when-let* ((val (cadr (assoc p entries)))
                        (name (aref val 0))
                        (pid (aref val 1))
                        (status (aref val 2))
                        (status (list status
                                      'face
                                      (if (memq status '(stop exit closed failed))
                                          'error
                                        'success)))
                        (buf-label (aref val 3))
                        (tty (list (aref val 4) 'face 'font-lock-doc-face))
                        (thread (list (aref val 5) 'face 'font-lock-doc-face))
                        (cmd (list (aref val 6) 'face 'completions-annotations)))
              (push (list p (vector name pid status buf-label tty thread cmd))
                    tabulated-list-entries)))))
      (advice-add #'list-processes--refresh :after #'my/list-processes--prettify)))

  ;; 简化确认
  (setq use-short-answers t)
  (setq y-or-n-p-use-read-key t
        read-char-choice-use-read-key t)

  ;; 默认设置
  (setq-default major-mode 'text-mode
                fill-column 80
                tab-width 4)

  (setq visible-bell t
        inhibit-compacting-font-caches t
        delete-by-moving-to-trash t
        make-backup-files nil
        auto-save-default nil
        uniquify-buffer-name-style 'post-forward-angle-brackets
        adaptive-fill-regexp "[ t]+|[ t]*([0-9]+.|*+)[ t]*"
        adaptive-fill-first-line-regexp "^* *$"
        sentence-end "\\([。！？]\\|……\\|[.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*"
        sentence-end-double-space nil
        word-wrap-by-category t)
#+end_src

** UI 界面
*** 主题配置
#+begin_src emacs-lisp
    (use-package panel
      :vc (panel :url "https://github.com/LuciusChen/panel.git"
                 :branch "main")
      :hook (after-init . panel-create-hook)   ;; 或者 (emacs-startup . panel-create-hook)
      :config
      ;; 基础显示配置
      (setq panel-title "Happy hacking, Emacs ♥  you"
            panel-show-file-path nil
            panel-min-left-padding 10
            panel-path-max-length 20
            ;; 地理位置 - 大连
            panel-latitude 38.9140
            panel-longitude 121.6147
            ;; 图片配置
            panel-image-file (concat (locate-user-emacs-file "etc/bitmap.png"))
            panel-image-width 400
            panel-image-height 169))
  ;; (panel-create-hook)

    (use-package circadian
      :ensure t
      :defer t
      ;; 不要在 load-path 扫描时就加载包
      :init
      ;; 这里写变量设置，不会触发包的真正加载
      (setq circadian-themes
            '((:sunrise . dichromacy)
              (:sunset  . misterioso))
            calendar-latitude  38.9140
            calendar-longitude 121.6147
            calendar-location-name "Dalian")
      :hook (after-init . circadian-setup))
    ;;初始 frame 设置
    ;; (setq initial-frame-alist '((top . 0.5)
    ;;                             (left . 0.5)
    ;;                             (width . 0.7)
    ;;                             (height . 0.85)
    ;;                             (fullscreen)))
#+end_src

*** 字体配置

#+begin_src emacs-lisp
  (defun font-available-p (font-name)
    "Return non-nil if FONT-NAME can be found."
    (find-font (font-spec :name font-name)))

  ;;(defvar my/han-font nil
  ;;   "当前实际用到的汉字字体家族，给后面 bold 映射用。")

  ;; (defun my/setup-fonts ()
  ;;  "Apply fonts to the current frame."	
   ;;  (when (display-graphic-p)
  ;;     ;; 1. 英文字体
  ;;     (set-face-attribute 'default nil
  ;;                         :font "IosevkaTerm NF"
  ;;                         :height 120)
  ;;     ;; 2. 中文字体（找到后把名字存到 my/han-font）
  ;;     (cl-loop for font in '("Sarasa Mono SC" "LXGW Neo Xihei" "LXGW WenKai Mono" "Microsoft Yahei UI")
  ;;              when (font-available-p font)
  ;;              return (progn
  ;;                       (setq face-font-rescale-alist `((,font . 1.3)))
  ;;                       (set-fontset-font t 'han (font-spec :family font))
  ;;                       font))
  ;;     ;; 3. 符号/emoji 维持你原来的逻辑
  ;;     (cl-loop for font in '("Symbols Nerd Font Mono" "Apple Symbols" "Segoe UI Symbol" "Symbola" "Symbol")
  ;;              when (font-available-p font)
  ;;              return (set-fontset-font t 'symbol (font-spec :family font) nil 'prepend))
  ;;     (cl-loop for font in '("Noto Color Emoji" "Apple Color Emoji" "Segoe UI Emoji")
  ;;              when (font-available-p font)
  ;;              do (set-fontset-font t 'emoji (font-spec :family font) nil 'prepend)
  ;;              and return nil)))

  ;; ;; 下面 3 行你原来就有，完全不用动
  ;; (add-hook 'after-init-hook #'my/setup-fonts)
  ;; (add-hook 'after-make-frame-functions
  ;;           (lambda (frame)
  ;;             (with-selected-frame frame
  ;;               (my/setup-fonts))))
  ;; (add-hook 'circadian-after-load-theme-hook
  ;;           (lambda (_theme)
  ;;             (my/setup-fonts)))

  (defvar my/font-cache nil) ;; plist: (:han "Sarasa..." :symbol "..." :emoji "...")
  (defun my/detect-fonts ()
    (unless my/font-cache
      (setq my/font-cache
            (list
             :han (cl-loop for f in '("Sarasa Mono SC" "LXGW Neo Xihei" "LXGW WenKai Mono" "Microsoft Yahei UI")
                           when (font-available-p f) return f)
             :symbol (cl-loop for f in '("Symbols Nerd Font Mono" "Apple Symbols" "Segoe UI Symbol" "Symbola" "Symbol")
                              when (font-available-p f) return f)
             :emoji (cl-loop for f in '("Noto Color Emoji" "Apple Color Emoji" "Segoe UI Emoji")
                             when (font-available-p f) return f)))))

  (defun my/apply-fonts-to-frame (&optional frame)
    (with-selected-frame (or frame (selected-frame))
      (when (display-graphic-p)
        (my/detect-fonts)
        (set-face-attribute 'default nil :font "IosevkaTerm NF" :height 120)
        (let ((han (plist-get my/font-cache :han))
              (sym (plist-get my/font-cache :symbol))
              (emo (plist-get my/font-cache :emoji)))
          (when han
            (setq face-font-rescale-alist `((,han . 1.3)))
            (set-fontset-font t 'han (font-spec :family han)))
          (when sym
            (set-fontset-font t 'symbol (font-spec :family sym) nil 'prepend))
          (when emo
            (set-fontset-font t 'emoji (font-spec :family emo) nil 'prepend))))))

  (add-hook 'after-init-hook #'my/apply-fonts-to-frame)
  (add-hook 'after-make-frame-functions #'my/apply-fonts-to-frame)
  (add-hook 'circadian-after-load-theme-hook (lambda (_theme) (my/apply-fonts-to-frame)))

#+end_src

*** 图标与 Modeline

#+begin_src emacs-lisp
  (use-package nerd-icons
    :ensure t)
#+end_src

